import React, { useEffect } from 'react'
import { Button } from 'react-bootstrap'
import ReactPlayer from 'react-player'
import { useHistory } from 'react-router-dom/cjs/react-router-dom.min'

export default function GaneshChalisa() {
    const history = useHistory()
    useEffect(() => {
        window.scrollTo(0, 0)
    }, [])
    return (
        <div className='chalisa'>
            <div className='top_buttons'>
                <Button onClick={() => history.push('/')} className='back_button' variant='warning'>Back to Home</Button>
                <Button onClick={() => history.push('/aarti/ganesha')} className='back_button' variant='warning'>Go to Aarti</Button>
            </div>
            <div className='chalisa_body'>
                <ReactPlayer controls={true} className="react_player" url='https://youtu.be/WyHFSjN0miU?si=BgfwDP6gvRRRFjqn' />
                <h2 className='chalisa_title'>Shri Ganesh Chalisa</h2>
                <div className='chalisa_table'>
                    <b>॥ दोहा ॥</b>
                    <br />
                    जय गणपति सदगुण सदन, कविवर बदन कृपाल ।
                    <br />
                    विघ्न हरण मंगल करण, जय जय गिरिजालाल ॥
                    <br /><br />
                    <b>॥ चौपाई ॥</b>
                    <br />
                    <b>जय जय जय गणपति गणराजू ।</b>
                    <br />
                    <b>मंगल भरण करण शुभः काजू ॥</b>
                    <br />
                    <br />

                    जै गजबदन सदन सुखदाता ।
                    <br />

                    विश्व विनायका बुद्धि विधाता ॥
                    <br />
                    <br />
                    <b>वक्र तुण्ड शुची शुण्ड सुहावना ।</b>
                    <br />
                    <b>तिलक त्रिपुण्ड भाल मन भावन ॥</b>
                    <br />
                    <br />

                    राजत मणि मुक्तन उर माला ।
                    <br />

                    स्वर्ण मुकुट शिर नयन विशाला ॥
                    <br />
                    <br />
                    <b>पुस्तक पाणि कुठार त्रिशूलं ।</b>
                    <br />
                    <b>मोदक भोग सुगन्धित फूलं ॥</b>
                    <br />
                    <br />

                    सुन्दर पीताम्बर तन साजित ।
                    <br />

                    चरण पादुका मुनि मन राजित ॥
                    <br />
                    <br />
                    <b>धनि शिव सुवन षडानन भ्राता ।</b>
                    <br />
                    <b>गौरी लालन विश्व-विख्याता ॥</b>
                    <br />
                    <br />

                    ऋद्धि-सिद्धि तव चंवर सुधारे ।
                    <br />

                    मुषक वाहन सोहत द्वारे ॥
                    <br />
                    <br />
                    <b>कहौ जन्म शुभ कथा तुम्हारी ।</b>
                    <br />
                    <b>अति शुची पावन मंगलकारी ॥</b>
                    <br />
                    <br />

                    एक समय गिरिराज कुमारी ।
                    <br />

                    पुत्र हेतु तप कीन्हा भारी ॥ 10 ॥
                    <br />
                    <br />
                    <b>भयो यज्ञ जब पूर्ण अनूपा ।</b>
                    <br />
                    <b>तब पहुंच्यो तुम धरी द्विज रूपा ॥</b>
                    <br />
                    <br />

                    अतिथि जानी के गौरी सुखारी ।
                    <br />

                    बहुविधि सेवा करी तुम्हारी ॥
                    <br />
                    <br />
                    <b>अति प्रसन्न हवै तुम वर दीन्हा ।</b>
                    <br />
                    <b>मातु पुत्र हित जो तप कीन्हा ॥</b>
                    <br />
                    <br />

                    मिलहि पुत्र तुहि, बुद्धि विशाला ।
                    <br />

                    बिना गर्भ धारण यहि काला ॥
                    <br />
                    <br />
                    <b>गणनायक गुण ज्ञान निधाना ।</b>
                    <br />
                    <b>पूजित प्रथम रूप भगवाना ॥</b>
                    <br />
                    <br />

                    अस कही अन्तर्धान रूप हवै ।
                    <br />

                    पालना पर बालक स्वरूप हवै ॥
                    <br />
                    <br />
                    <b>बनि शिशु रुदन जबहिं तुम ठाना ।</b>
                    <br />
                    <b>लखि मुख सुख नहिं गौरी समाना ॥</b>
                    <br />
                    <br />

                    सकल मगन, सुखमंगल गावहिं ।
                    <br />

                    नाभ ते सुरन, सुमन वर्षावहिं ॥
                    <br />
                    <br />
                    <b>शम्भु, उमा, बहुदान लुटावहिं ।</b>
                    <br />
                    <b>सुर मुनिजन, सुत देखन आवहिं ॥</b>
                    <br />
                    <br />

                    लखि अति आनन्द मंगल साजा ।
                    <br />

                    देखन भी आये शनि राजा ॥ 20 ॥
                    <br />
                    <br />
                    <b>निज अवगुण गुनि शनि मन माहीं ।</b>
                    <br />
                    <b>बालक, देखन चाहत नाहीं ॥</b>
                    <br />
                    <br />

                    गिरिजा कछु मन भेद बढायो ।
                    <br />

                    उत्सव मोर, न शनि तुही भायो ॥
                    <br />
                    <br />
                    <b>कहत लगे शनि, मन सकुचाई ।</b>
                    <br />
                    <b>का करिहौ, शिशु मोहि दिखाई ॥</b>
                    <br />
                    <br />

                    नहिं विश्वास, उमा उर भयऊ ।
                    <br />

                    शनि सों बालक देखन कहयऊ ॥
                    <br />
                    <br />
                    <b>पदतहिं शनि दृग कोण प्रकाशा ।</b>
                    <br />
                    <b>बालक सिर उड़ि गयो अकाशा ॥</b>
                    <br />
                    <br />

                    गिरिजा गिरी विकल हवै धरणी ।
                    <br />

                    सो दुःख दशा गयो नहीं वरणी ॥
                    <br />
                    <br />
                    <b>हाहाकार मच्यौ कैलाशा ।</b>
                    <br />
                    <b>शनि कीन्हों लखि सुत को नाशा ॥</b>
                    <br />
                    <br />

                    तुरत गरुड़ चढ़ि विष्णु सिधायो ।
                    <br />

                    काटी चक्र सो गज सिर लाये ॥
                    <br />
                    <br />
                    <b>बालक के धड़ ऊपर धारयो ।</b>
                    <br />
                    <b>प्राण मन्त्र पढ़ि शंकर डारयो ॥</b>
                    <br />
                    <br />

                    नाम गणेश शम्भु तब कीन्हे ।
                    <br />

                    प्रथम पूज्य बुद्धि निधि, वर दीन्हे ॥ 30 ॥
                    <br />
                    <br />
                    <b>बुद्धि परीक्षा जब शिव कीन्हा ।</b>
                    <br />
                    <b>पृथ्वी कर प्रदक्षिणा लीन्हा ॥</b>
                    <br />
                    <br />

                    चले षडानन, भरमि भुलाई ।
                    <br />

                    रचे बैठ तुम बुद्धि उपाई ॥
                    <br />
                    <br />
                    <b>चरण मातु-पितु के धर लीन्हें ।</b>
                    <br />
                    <b>तिनके सात प्रदक्षिण कीन्हें ॥</b>
                    <br />
                    <br />

                    धनि गणेश कही शिव हिये हरषे ।
                    <br />

                    नभ ते सुरन सुमन बहु बरसे ॥
                    <br />
                    <br />
                    <b>तुम्हरी महिमा बुद्धि बड़ाई ।</b>
                    <br />
                    <b>शेष सहसमुख सके न गाई ॥</b>
                    <br />
                    <br />

                    मैं मतिहीन मलीन दुखारी ।
                    <br />

                    करहूं कौन विधि विनय तुम्हारी ॥
                    <br />
                    <br />
                    <b>भजत रामसुन्दर प्रभुदासा ।</b>
                    <br />
                    <b>जग प्रयाग, ककरा, दुर्वासा ॥</b>
                    <br />
                    <br />

                    अब प्रभु दया दीना पर कीजै ।
                    <br />

                    अपनी शक्ति भक्ति कुछ दीजै ॥ 38 ॥
                    <br />
                    <br />
                    <b>॥ दोहा ॥</b>
                    <br />

                    श्री गणेश यह चालीसा, पाठ करै कर ध्यान ।
                    <br />
                    नित नव मंगल गृह बसै, लहे जगत सन्मान ॥
                    <br />
                    <br />
                    सम्बन्ध अपने सहस्त्र दश, ऋषि पंचमी दिनेश ।
                    <br />
                    पूरण चालीसा भयो, मंगल मूर्ती गणेश ॥
                </div>
            </div>
            <div className='bottom_buttons'>
                <Button onClick={() => history.push('/')} className='back_button' variant='warning'>Back to Home</Button>
                <Button onClick={() => history.push('/aarti/ganesha')} className='back_button' variant='warning'>Go to Aarti</Button>
            </div>
        </div>
    )
}
