import React, { useEffect } from 'react'
import { Button } from 'react-bootstrap'
import { useHistory } from 'react-router-dom/cjs/react-router-dom.min'
import ReactPlayer from 'react-player'

export default function HanumanChalisa() {
    const history = useHistory()
    useEffect(() => {
        window.scrollTo(0, 0)
    }, [])
    return (
        <div className='chalisa'>
            <div className='top_buttons'>
                <Button onClick={() => history.push('/')} className='back_button' variant='warning'>Back to Home</Button>
                <Button onClick={() => history.push('/aarti/hanuman')} className='back_button' variant='warning'>Go to Aarti</Button>
            </div>
            <div className='chalisa_body'>
                <ReactPlayer controls={true} className="react_player" url='https://youtu.be/AETFvQonfV8?si=8E-IR2chCKM7wG-W' />
                <h2 className='chalisa_title'>Shri Hanuman Chalisa</h2>
                <div className='chalisa_table'>
                    <b>॥ दोहा॥</b>
                    <br />
                    <b>श्रीगुरु चरन सरोज रज निज मनु मुकुरु सुधारि ।</b>
                    <br />
                    <b>बरनउँ रघुबर बिमल जसु जो दायकु फल चारि ॥</b>
                    <br /><br />
                    बुद्धिहीन तनु जानिके सुमिरौं पवन-कुमार ।
                    <br />
                    बल बुधि बिद्या देहु मोहिं हरहु कलेस बिकार ॥
                    <br />
                    <br />
                    <b>॥ चौपाई ॥</b>
                    <br />
                    <b>जय हनुमान ज्ञान गुन सागर ।</b>
                    <br />
                    <b>जय कपीस तिहुँ लोक उजागर ॥</b>
                    <br />
                    <br />

                    राम दूत अतुलित बल धामा ।
                    <br />

                    अंजनि पुत्र पवनसुत नामा ॥
                    <br />
                    <br />
                    <b>महाबीर बिक्रम बजरंगी ।</b>
                    <br />
                    <b>कुमति निवार सुमति के संगी ॥</b>
                    <br />
                    <br />

                    कंचन बरन बिराज सुबेसा ।
                    <br />

                    कानन कुण्डल कुँचित केसा ॥४
                    <br />
                    <br />
                    <b>हाथ बज्र अरु ध्वजा बिराजै ।</b>
                    <br />
                    <b>काँधे मूँज जनेउ साजै ॥</b>
                    <br />
                    <br />

                    शंकर स्वयं/सुवन केसरी नंदन ।
                    <br />

                    तेज प्रताप महा जगवंदन ॥
                    <br />
                    <br />
                    <b>बिद्यावान गुनी अति चातुर ।</b>
                    <br />
                    <b>राम काज करिबे को आतुर ॥</b>
                    <br />
                    <br />

                    प्रभु चरित्र सुनिबे को रसिया ।
                    <br />

                    राम लखन सीता मन बसिया ॥८
                    <br />
                    <br />
                    <b>सूक्ष्म रूप धरि सियहिं दिखावा ।</b>
                    <br />
                    <b>बिकट रूप धरि लंक जरावा ॥</b>
                    <br />
                    <br />

                    भीम रूप धरि असुर सँहारे ।
                    <br />

                    रामचन्द्र के काज सँवारे ॥
                    <br />
                    <br />
                    <b>लाय सजीवन लखन जियाए ।</b>
                    <br />
                    <b>श्री रघुबीर हरषि उर लाये ॥</b>
                    <br />
                    <br />

                    रघुपति कीन्ही बहुत बड़ाई ।
                    <br />

                    तुम मम प्रिय भरतहि सम भाई ॥१२
                    <br />
                    <br />
                    <b>सहस बदन तुम्हरो जस गावैं ।</b>
                    <br />
                    <b>अस कहि श्रीपति कण्ठ लगावैं ॥</b>
                    <br />
                    <br />

                    सनकादिक ब्रह्मादि मुनीसा ।
                    <br />

                    नारद सारद सहित अहीसा ॥
                    <br />
                    <br />
                    <b>जम कुबेर दिगपाल जहाँ ते ।</b>
                    <br />
                    <b>कबि कोबिद कहि सके कहाँ ते ॥</b>
                    <br />
                    <br />

                    तुम उपकार सुग्रीवहिं कीह्ना ।
                    <br />

                    राम मिलाय राज पद दीह्ना ॥१६
                    <br />
                    <br />
                    <b>तुम्हरो मंत्र बिभीषण माना ।</b>
                    <br />
                    <b>लंकेश्वर भए सब जग जाना ॥</b>
                    <br />
                    <br />

                    जुग सहस्त्र जोजन पर भानु ।
                    <br />

                    लील्यो ताहि मधुर फल जानू ॥
                    <br />
                    <br />
                    <b>प्रभु मुद्रिका मेलि मुख माहीं ।</b>
                    <br />
                    <b>जलधि लाँघि गये अचरज नाहीं ॥</b>
                    <br />
                    <br />

                    दुर्गम काज जगत के जेते ।
                    <br />

                    सुगम अनुग्रह तुम्हरे तेते ॥२०
                    <br />
                    <br />
                    <b>राम दुआरे तुम रखवारे ।</b>
                    <br />
                    <b>होत न आज्ञा बिनु पैसारे ॥</b>
                    <br />
                    <br />

                    सब सुख लहै तुम्हारी सरना ।
                    <br />

                    तुम रक्षक काहू को डरना ॥
                    <br />
                    <br />
                    <b>आपन तेज सम्हारो आपै ।</b>
                    <br />
                    <b>तीनों लोक हाँक तै काँपै ॥</b>
                    <br />
                    <br />

                    भूत पिशाच निकट नहिं आवै ।
                    <br />

                    महावीर जब नाम सुनावै ॥२४
                    <br />
                    <br />
                    <b>नासै रोग हरै सब पीरा ।</b>
                    <br />
                    <b>जपत निरंतर हनुमत बीरा ॥</b>
                    <br />
                    <br />

                    संकट तै हनुमान छुडावै ।
                    <br />

                    मन क्रम बचन ध्यान जो लावै ॥
                    <br />
                    <br />
                    <b>सब पर राम तपस्वी राजा ।</b>
                    <br />
                    <b>तिनके काज सकल तुम साजा ॥</b>
                    <br />
                    <br />

                    और मनोरथ जो कोई लावै ।
                    <br />

                    सोई अमित जीवन फल पावै ॥२८
                    <br />
                    <br />
                    <b>चारों जुग परताप तुम्हारा ।</b>
                    <br />
                    <b>है परसिद्ध जगत उजियारा ॥</b>
                    <br />
                    <br />

                    साधु सन्त के तुम रखवारे ।
                    <br />

                    असुर निकंदन राम दुलारे ॥
                    <br />
                    <br />
                    <b>अष्ट सिद्धि नौ निधि के दाता ।</b>
                    <br />
                    <b>अस बर दीन जानकी माता ॥</b>
                    <br />
                    <br />

                    राम रसायन तुम्हरे पासा ।
                    <br />

                    सदा रहो रघुपति के दासा ॥३२
                    <br />
                    <br />
                    <b>तुम्हरे भजन राम को पावै ।</b>
                    <br />
                    <b>जनम जनम के दुख बिसरावै ॥</b>
                    <br />
                    <br />

                    अंतकाल रघुवरपुर जाई ।
                    <br />

                    जहाँ जन्म हरिभक्त कहाई ॥
                    <br />
                    <br />
                    <b>और देवता चित्त ना धरई ।</b>
                    <br />
                    <b>हनुमत सेइ सर्ब सुख करई ॥</b>
                    <br />
                    <br />

                    संकट कटै मिटै सब पीरा ।
                    <br />

                    जो सुमिरै हनुमत बलबीरा ॥३६
                    <br />
                    <br />
                    <b>जै जै जै हनुमान गोसाईं ।</b>
                    <br />
                    <b>कृपा करहु गुरुदेव की नाईं ॥</b>
                    <br />
                    <br />

                    जो सत बार पाठ कर कोई ।
                    <br />

                    छूटहि बंदि महा सुख होई ॥
                    <br />
                    <br />
                    <b>जो यह पढ़ै हनुमान चालीसा ।</b>
                    <br />
                    <b>होय सिद्धि साखी गौरीसा ॥</b>
                    <br />
                    <br />

                    तुलसीदास सदा हरि चेरा ।
                    <br />

                    कीजै नाथ हृदय मह डेरा ॥४०
                    <br />
                    <br />
                    <b>॥ दोहा ॥</b>
                    <br />
                    पवन तनय संकट हरन, मंगल मूरति रूप ।
                    <br />
                    राम लखन सीता सहित, हृदय बसहु सुर भूप ॥
                </div>
            </div>
            <div className='bottom_buttons'>
                <Button onClick={() => history.push('/')} className='back_button' variant='warning'>Back to Home</Button>
                <Button onClick={() => history.push('/aarti/hanuman')} className='back_button' variant='warning'>Go to Aarti</Button>
            </div>
        </div >
    )
}
